Управление_торговлей.ПБТ/src/InformationRegisters/вт_ГрафикВыполненияПроизводства/вт_ГрафикВыполненияПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>вт_ГрафикВыполненияПроизводства</name>
  <resources>
    <name>Выполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбрабатываетсяРегламентнымЗаданием</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.вт_ЗаказВПроизводство</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.вт_ЗаказВПроизводство</types>
      <types>DocumentRef.вт_ПланПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>Производимая продукция, если операция запланирована в разрезе готовой продукции</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Операция</name>
    <comment>Выполняемая операция</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтчетПроизводства</name>
    <type>
      <types>DocumentRef.вт_ОтчетПроизводства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_торговлей.ПБТ/src/Catalogs/вт_ВариантыПроизводстваПоТехКартам/вт_ВариантыПроизводстваПоТехКартам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вт_ВариантыПроизводстваПоТехКартам</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесДетали</name>
    <comment>Вес детали необработанной</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесЛитника</name>
    <comment>Вес отходов обработки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МатералЛитника</name>
    <comment>Материал отходов</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПроизводстваСек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПроизводстваЧас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Стоимость</name>
    <comment>Плановая расчетная себестоимость</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРасчетаСебестоимость</name>
    <type>
      <types>EnumRef.вт_ВариантРасчетаПлановойСебестоимости</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписиСтоимости</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдИзм</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураБрака</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРецепта</name>
    <comment>Код ордера</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВведения</name>
    <comment>Дата введения рецепта</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокЗакладки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыРецептов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Сырье</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>9</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПроцент</name>
      <comment>Если ИСТИНА, то поле Количество это проценты</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СписыватьПоВсегоИзготовлено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>Плановая расчетная себестоимость</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСырья</name>
      <type>
        <types>CatalogRef.ВидыСырья</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Операции</name>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаВремени</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>Плановая расчетная цена</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Отходы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентОтходов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Неликвиды</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентЗакладки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Управление_торговлей.ПБТ/src/CommonModules/вт_ОбщийМодульПроизводства/Module.bsl
&НаСервере
Функция ПолучитьМинМаксОстаток(СсылкаНоменклатура, ИмяРеквизита)   Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НоменклатураДополнительныеРеквизиты.Значение КАК Значение
	                      |ИЗ
	                      |	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	                      |ГДЕ
	                      |	НоменклатураДополнительныеРеквизиты.Ссылка = &Ссылка
	                      |	И НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = &Заголовок");
	Запрос.УстановитьПараметр("Ссылка",СсылкаНоменклатура);
	Запрос.УстановитьПараметр("Заголовок",ИмяРеквизита);
	
	ЗначРеквизита = 0;
	выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		  ЗначРеквизита = Выборка.Значение;
	КонецЕсли;
	
	Возврат ЗначРеквизита;
КонецФункции

&НаСервере
Функция ПолучитьВариантПроизводстваПродукции(пГотоваяПродукция, пХарактеристикаПродукции=Неопределено) Экспорт
	пВариантПроизводства = Новый Структура("Ссылка,Время",Справочники.вт_ВариантыПроизводстваПоТехКартам.ПустаяСсылка(),0);	
	ОтборПоХарактеристике = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	Если  пХарактеристикаПродукции<>Неопределено ТОгда
		ОтборПоХарактеристике =   пХарактеристикаПродукции;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вт_ВариантыПроизводстваПоТехКартам.ВремяПроизводстваСек КАК ВремяПроизводстваСек,
		|	вт_ВариантыПроизводстваПоТехКартам.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.вт_ВариантыПроизводстваПоТехКартам КАК вт_ВариантыПроизводстваПоТехКартам
		|ГДЕ
		|	вт_ВариантыПроизводстваПоТехКартам.Владелец = &Владелец
		|	И вт_ВариантыПроизводстваПоТехКартам.Основной = ИСТИНА
		|	И вт_ВариантыПроизводстваПоТехКартам.Характеристика = &Характеристика
		//|	И вт_ВариантыПроизводстваПоТехКартам.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРецептов.Стандартный)
		|	И вт_ВариантыПроизводстваПоТехКартам.Основной
		|
		|УПОРЯДОЧИТЬ ПО
		|	вт_ВариантыПроизводстваПоТехКартам.Основной"; 	
	Запрос.УстановитьПараметр("Владелец", пГотоваяПродукция);	
	Запрос.УстановитьПараметр("Характеристика", ОтборПоХарактеристике);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
		ВыборкаДетальныеЗаписи.Следующий();
		Если ВыборкаДетальныеЗаписи.Ссылка <> Неопределено Тогда
			пВариантПроизводства.Ссылка = ВыборкаДетальныеЗаписи.Ссылка;
			пВариантПроизводства.Время = ВыборкаДетальныеЗаписи.ВремяПроизводстваСек;
		КонецЕсли;	
	КонецЕсли;
	Возврат пВариантПроизводства;
КонецФункции

&НаСервере
Функция ПолучитьВариантКомплектации(пНоменклатура) Экспорт
	пВариантКомплектации = Новый Структура("Ссылка",Справочники.ВариантыКомплектацииНоменклатуры.ПустаяСсылка());	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВариантыКомплектацииНоменклатуры.Ссылка
		|ИЗ
		|	Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
		|ГДЕ
		|	ВариантыКомплектацииНоменклатуры.Основной = ИСТИНА
		|	И ВариантыКомплектацииНоменклатуры.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", пНоменклатура);	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
		ВыборкаДетальныеЗаписи.Следующий();
		Если ВыборкаДетальныеЗаписи.Ссылка <> Неопределено Тогда
			пВариантКомплектации.Ссылка = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЕсли;	
	КонецЕсли;
	Возврат пВариантКомплектации;
	
КонецФункции

&НаСервере 
Процедура АвтоСозданиеОтчетовПроизводства() Экспорт
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.вт_АвтоСозданиеОтчетовПроизводства);
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	вт_ГрафикВыполненияПроизводства.Заказ КАК Заказ,
	               |	вт_ГрафикВыполненияПроизводства.ДокументОснование КАК ДокументОснование,
	               |	МАКСИМУМ(вт_ГрафикВыполненияПроизводства.ДатаОкончания) КАК ДатаОкончания
	               |ИЗ
	               |	РегистрСведений.вт_ГрафикВыполненияПроизводства КАК вт_ГрафикВыполненияПроизводства
	               |ГДЕ
	               |	вт_ГрафикВыполненияПроизводства.ОбрабатываетсяРегламентнымЗаданием
	               |	И вт_ГрафикВыполненияПроизводства.ДатаОкончания <= &ТекДата
	               |	И вт_ГрафикВыполненияПроизводства.ОтчетПроизводства = ЗНАЧЕНИЕ(Документ.вт_ОтчетПроизводства.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	вт_ГрафикВыполненияПроизводства.Заказ,
	               |	вт_ГрафикВыполненияПроизводства.ДокументОснование";
	Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Заказ = Выборка.Заказ;
		ДокОснование = Выборка.ДокументОснование;
		ДатаОкончания = Выборка.ДатаОкончания;
		СформироватьОтчетПроизводства(Заказ,ДокОснование,ДатаОкончания);
	КонецЦикла;	
КонецПроцедуры	

&НаСервере 
Процедура СформироватьОтчетПроизводства(Заказ,ДокОснование,ДатаОкончания)
	НовыйОтчетПроизводства = Документы.вт_ОтчетПроизводства.СоздатьДокумент();
	НовыйОтчетПроизводства.Заполнить(Заказ); 	
	НовыйОтчетПроизводства.Дата = ДатаОкончания;
	НовыйОтчетПроизводства.ОтразитьВРеглУчете = Ложь;
	НовыйОтчетПроизводства.ОтразитьВПроизводственномУчете = Истина;
	СтруктураОтбора = Новый Структура("ДокументОснование",ДокОснование);
	Попытка
		НовыйОтчетПроизводства.Записать();
		
		Выборка = РегистрыСведений.вт_ГрафикВыполненияПроизводства.Выбрать(СтруктураОтбора);
		Пока Выборка.Следующий() Цикл
			ТекЗапись = Выборка.ПолучитьМенеджерЗаписи();
			Если ТекЗапись.Заказ = Заказ Тогда
				ТекЗапись.Прочитать();
				ТекЗапись.ОтчетПроизводства = НовыйОтчетПроизводства.Ссылка;
				ТекЗапись.ОбрабатываетсяРегламентнымЗаданием = Ложь;
				ТекЗапись.Записать(Истина);
			КонецЕсли;	
		КонецЦикла;	
				
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Автоформирование отчетов производства '"+ОписаниеОшибки(), ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка, , ,
		НСтр("ru = 'Автоформирование отчетов производства'"));   		
	КонецПопытки;
	Попытка
		НовыйОтчетПроизводства.Записать(РежимЗаписиДокумента.Проведение); 		
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Автоформирование отчетов производства '"+ОписаниеОшибки(), ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка, , ,
		НСтр("ru = 'Автоформирование отчетов производства'"));   		
	КонецПопытки;	
КонецПроцедуры
